---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.HorizontalFlipped
source: html/bf5a61c7-e8d5-631d-749a-659084be1723.htm
---
# Autodesk.Revit.DB.HostedSweep.HorizontalFlipped Property

Retrieve the horizontal flip status of the hosted sweep object.

## Syntax (C#)
```csharp
public bool HorizontalFlipped { get; }
```